const cat = 'c'; //вообще нафиг не нужна - тк будем использована только если 1 дочерний консоль лог выше в теле функции
//не будет иметь объявление переменной.
//при этом если не будет объявлено значение чпекс - то выведется кекс, тк это значение будет выше по запросу

function log () {
	const cat = 'кекс';
	console.log(cat); //кекс

	if (2 > 1) {
		const cat = 'чпекс';
		console.log(cat); //чпекс
	}
}

log();

////////////////////////////////////////
function init() {
  var name = "Mozilla"; // name - локальная переменная, созданная в init
  function displayName() {
    // displayName() - внутренняя функция, замыкание
    alert(name); // displayName() использует переменную, объявленную в родительской функции
  }
  displayName();
}
init();
// init() создаёт локальную переменную name и определяет функцию displayName(). displayName() — это внутренняя функция — 
// она определена внутри init() и доступна только внутри тела функции init(). Обратите внимание, что функция displayName()
//  не имеет никаких собственных локальных переменных. Однако, поскольку внутренние функции имеют доступ к переменным
//   внешних функций, displayName() может иметь доступ к переменной name,
// объявленной в родительской функции init().

function makeAdder(x) {
  return function (y) {
    return x + y;
  };
}

var add5 = makeAdder(5);
var add10 = makeAdder(10);

console.log(add5(2)); // 7
console.log(add10(2)); // 12

// Здесь мы определили функцию makeAdder(x), которая получает единственный аргумент x и возвращает новую функцию.
// Эта функция получает единственный аргумент y и возвращает сумму x и y.
// По существу makeAdder — это фабрика функций: она создаёт функции, которые могут прибавлять определённое значение
// к своему аргументу. В примере выше мы используем нашу фабричную функцию для создания двух новых функций — одна
// прибавляет 5 к своему аргументу, вторая прибавляет 10.
// add5 и add10 — это примеры замыканий. Эти функции делят одно определение тела функции, но при этом они сохраняют 
// различные окружения. В окружении функции add5 x — это 5, в то время как в окружении add10 x — это 10.